Revit 2026 API

# PartUtilsGetAssociatedPartMaker(Document, LinkElementId) Method

---

Gets associated PartMaker for an element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PartMaker GetAssociatedPartMaker(
	Document hostDocument,
	LinkElementId hostOrLinkElementId
)
```
```vb
Public Shared Function GetAssociatedPartMaker (
	hostDocument As Document,
	hostOrLinkElementId As LinkElementId
) As PartMaker
```
```cpp
public:
static PartMaker^ GetAssociatedPartMaker(
	Document^ hostDocument,
	LinkElementId^ hostOrLinkElementId
)
```
```fsharp
static member GetAssociatedPartMaker :
        hostDocument : Document *
        hostOrLinkElementId : LinkElementId -> PartMaker
```

#### Parameters

hostDocument Document
     The document
hostOrLinkElementId LinkElementId
     The id for the element to be checked for associated Parts

#### Return Value

PartMaker The PartMaker element that is making Parts for this element.  if there is no associated PartMaker.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

GetAssociatedPartMaker Overload

Autodesk.Revit.DB Namespace